[
  {
    "id" : 1,
    "name" : "Beretta 92X Performance",
    "image" : "beretta-92x",
    "price" : 7800,
    "description" : "Beretta 92X Performance Optic kal. 9x19 mm pistolet zmodyfikowany tak aby najlepiej sprostać użytkownikom w dziedzinie strzelectwa dynamicznego, przygotowany do pracy również z kolimatorami.  Stalowy szkielet, cięższy zamek typu Brigadier i mechanizm spustowy Extreme-S o drodze zredukowanej o 40% i oporze 1,5 kg w trybie SA to kluczowe cechy pistoletu Beretta 92X Performance Optic. Szkielet tupu Vertec z obszernym lejkiem posiada pionowy kąt chwytu, sama masa broni po zabiegach poprawkowych osiąga do 1350 gramów. Cecha ta ma stabilizować pistolet Beretta 92X Performance Optic podczas strzelania i redukować podrzut.   Pistolet Beretta 92x Performance Optic w przedniej części zamka posiada dodatkowe nacięcia pomagające w  przy przeładowaniu. Nacięciami pokryty został również przód i tył szkieletu. Projektanci powiększyli przycisk zwolnienia magazynka z możliwością zamontowania po obu stronach chwytu. Mechaniczne przyrządy w Beretta 92x Performance Optic wyposażone we wkładkę światłowodową, szczerbina jest regulowana w pionie i poziomie. Droga mechanizmu spustowego przed i po strzale jest regulowana śrubami wewnątrz szkieletu. Całości nadano dwukolorowe wykończenie w technologii Nistan. W zestawie znajdują się 2x15 nabojowe magazynki z powiększoną gumową stopką.",
  },
  {
    "id" : 2,
    "name" : "Glock 17 MOS Tactical",
    "image" : "glock-17",
    "price" : 4400,
    "description" : "Glock 17 piątej generacji w wersji MOS Tactical. Pistolet ten charakteryzuje niezwykle wytrzymała konstrukcja oraz ergonomia. Dzięki zrezygnowaniu z wycięcia na palce, broń idealnie leży w dłoni, niezależnie od jej wielkości. Dodatkowo, Glock 17 został wyposażony w dźwignię zwalniającą zamek po obu stronach, sprawiając że pistolet austriackiej produkcji jest bardziej przystępny dla osób leworęcznych. Całość konstrukcji została wykończona powłoką nDLC, zapewniając ochronę przed wszelkiego rodzaju uszkodzeniami mechanicznymi oraz rdzewieniem. Ponadto, powiększeniu uległo gniazdo magazynka, ułatwiając tym samym jego szybką wymianę (magazynki z poprzednich generacji są kompatybilne z gniazdem 5 generacji). Usprawnione zostały tez takie elementy jak mechanizm spustowy oraz iglica wraz z bezpiecznikiem. Glock 17 w wersji MOS Tactical posiada dodatkowo szynę montażową, umożliwiającą założenie kolimatora oraz gwintowaną lufę, pozwalając zainstalować tłumik lub kompensator.",

  },
  {
    "id" : 3,
    "name" : "Sig Sauer P320 XCARRY LEGION",
    "image" : "p320-xcarry-legion",
    "price" : 8600,
    "description" : "P320 Xcarry Legion to pistolet produkowany przez niemiecką firmę Sig Sauer w USA. Jest to skrócona wersja pistoletu P320 X-Five Legion, wyposażona dodatkowo w gwint na końcu lufy o skoku 1/2x28. Pistolet posiada szkieletowy język spustowy oraz możliwość montażu kolimatora, takiego jak Romeo 1 PRO lub Leupold Deltapoint Pro.  W przypadku tego modelu, szczerbinka znajduje się na płytce, która zakrywa wycięcie pod kolimator. Jej demontaż uniemożliwia korzystanie z tylnych przyrządów mechanicznych. Jednak w przypadku montażu kolimatora Romeo 1, istnieje namiastka szczerbinki, a dla Leupolda istnieje miejsce na jej zamontowanie.  Chwyt w P320 Xcarry Legion jest identyczny jak w przypadku P320 X-Five Legion. Jest to chwyt wykonany z polimeru wolframu, zwanego Tungsten X Grip, który zapewnia elastyczność. Zwiększa wagę pistoletu, co redukuje odrzut i podrzut. Chwyt jest wyposażony w duży lejek, który poprawia ergonomię i umożliwia szybką wymianę magazynków. Lejek jest łatwy do demontażu w przypadku sportowych konkurencji, w których jego użycie jest zabronione.  Pistolet posiada 17-nabojowy magazynek - łącznie w zestawie znajdują się trzy magazynki. Istnieje również możliwość korzystania z 21-nabojowych magazynków, jednakże takie magazynki będą wystawać i zaburzać ogólny design pistoletu. Warto również zauważyć, że pistolet posiada standardową szynę M1913, umożliwiającą montaż różnego rodzaju akcesoriów, takich jak latarki czy wskaźniki laserowe.",

  },
  {
    "id" : 4,
    "name" : "PSA Dagger Compact DLC",
    "image" : "psa-dagger-compact",
    "price" : 2699,
    "description" : "Kompaktowy pistolet z ramą polimerową, Palmetto Dagger Compact w wersji Black DLC. Wykonany z wysokiej jakości stali nierdzewnej i zaawansowanych polimerów. Zasilany amunicją kalibru 9x19 mm i magazynkiem PMAG 15 GL9 (15 nabojowym) posiada gładki mechanizm spustowy o pojedynczym działaniu. Extreme Carry Cuts zapewniają gładkie krawędzie z tyłu i z przodu suwadła, co ułatwia szybsze wyciąganie broni bez zaczepiania się o kaburę czy ubrania.",

  },
  {
    "id" : 5,
    "name" : "Beretta APX A1",
    "image" : "beretta-apx",
    "price" : 3350,
    "description" : "Pistolet Beretta APX A1 posiada jeden z najlepszych spustów w swojej klasie do dynamicznego strzelania. Zawdzięcza to między innymi szybkiemu resetowi, wyraźnemu punktowi przełamania oraz lekkiej pracy mechanizmu spustowego. W pistolecie znajdziemy trytową muszkę oraz czarną szczerbinkę, które ułatwią szybkie zgranie przyrządów niezależnie od ilości światła nas otaczającego.  Dodatkową zaletą będzie możliwość zamontowania przycisku odłączenia magazynka i dźwigni zatrzymania zamka z obu stron co pozwala na konfigurację broni według preferencji strzelca prawo jak i leworęcznego. Pistolet łatwo będzie dostosować do każdej dłoni ze względu na dłuższą ostrogę, wyżej podciętą osłonę spustu i modułowe nakładki chwytu. Wyższy chwyt i maksymalizacja jego powierzchni pozwoli na lepszą kontrolę odrzutu oraz naturalniejszą pozycję do strzelania.  Dodatkowo pistolet jest odporny na korozję i chemikalia dzięki zastosowanej powłoce Aquatech Shield.",

  },
  {
    "id" : 6,
    "name" : "HS H11 PRO RDR",
    "image" : "hs-h11",
    "price" : 3200,
    "description" : "Znany, sprawdzony i ceniony praktycznie na całym świecie pistolet HELLCAT firmy HS Produkt w prezentowanej wersji HS H11 PRO RDR stał się jeszcze lepszy dla wszystkich strzelców z większymi dłońmi. Dłuższa rękojeść, skrywająca oczywiście większą ilość amunicji bo aż 15 sztuk w opatentowanym przez producenta magazynku, zapewnia znacznie lepszy chwyt i zdecydowanie pomaga w szybkim i celnym strzelaniu. W zakresie skrytego noszenia udało się jednak osiągnąć świetny kompromis długości chwytu ze skutecznym chowaniem się pistoletu pod ubraniem. Wszystkie zalety podstawowego modelu H11 HELLCAT zostały zachowany przy jednoczesnym zwiększeniu pojemności magazynka i poprawieniu chwytu. Wersja PRO została stworzony przez HS produkt do przetrwania najcięższych warunków i zagwarantowania bezawaryjnego działania w sytuacji, której będziesz go potrzebował.  Dodatkowo kuta lufa Match Barrel zapewnia celność i wytrzymałość na wiele lat, stosując ją nawet w najcięższych warunkach. Pokrycie wewnętrzne chromem ułatwia czyszczenie, ale również zwiększa odporność na ścieranie powierzchni lufy. Zamek posiada głębokie i wyraźniejsze ząbki z przodu i z tyłu, co ułatwia przeładowanie broni, kiedy jest mokro lub jesteśmy w rękawiczkach, dodatkowo został on pokryty trwałą anodyzowaną powłoką, uodparniając materiał na niekorzystne oddziaływanie warunków atmosferycznych. Muszka i szczerbinka pistoletu HS H11 PRO RDR wykonane są ze stali i zostały poząbkowane w celu zapobiegania odblaskom światła. Szczerbina w kształcie U oraz światłowodowa muszka ułatwiają szybie zgranie przyrządów celowniczych. Wycięcie w zamku zostało dostosowane do montażu mikrokolimatorów bez użycia płytek montażowych, zapewnia to mniejszy dystans kropki celownika do osi lufy. Wcięcie jest kompatybilne z kolimatorami: RMSc Shield, JPoint, Trijicon MS03 i MS04 oraz Leopold Delta Point.   Co więcej wewnętrzne elementy zostały pokryte niklowaną powłoką aby wygładzić pracę mechanizmów, odczuwalną podczas ściągania spustu. Pistolet wyposażony jest w dwa wewnętrzne systemy bezpieczeństwa: zabezpieczenie iglicy oraz zabezpieczenie spustu. Wskaźnik naboju w komorze ułatwiają strzelcowi sprawdzenie stanu załadownia broni nawet w przypadku braku oświetlenia. ",

  }
]
